openfoam-cases/cylinder-zerofluid-dt0p001/Cylinder-zero-fluid-Newmark/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss QUICKV;
    div((nuEff*dev(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default                                 Gauss linear corrected;
    //laplacian(nuEff,U)                      Gauss linear corrected;
    //laplacian((1|A(U)),p)                   Gauss linear corrected;
    //laplacian(rAUf,pcorr)                   Gauss linear corrected;
    laplacian(diffusivity,cellMotionU)      Gauss linear uncorrected;
    laplacian(diffusivity,cellDisplacement) Gauss linear uncorrected;
}

interpolationSchemes
{
    default              linear;
}

snGradSchemes
{
    default    corrected;
}

fluxRequired
{
    default  no;
    p          ;
}


// ************************************************************************* //
